app/views/pages/_form.html.erb

SELECT "pages".* FROM "pages" WHERE "pages"."parent_id" = 2
---
    <%= f.label :parent_id %><br />
    <%= f.collection_select :parent_id, Page.all(:order => "name"), :id, :name, :include_blank => true %>