app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT "pages".* FROM "pages" WHERE (parent_id IS NULL)

  def create
    @page = Page.new(params[:page])
    if @page.save
---
INSERT INTO "pages" ("content", "created_at", "name", "parent_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", ""], ["created_at", Sun, 10 Feb 2013 07:09:45 UTC +00:00], ["name", "test3"], ["parent_id", nil], ["updated_at", Sun, 10 Feb 2013 07:09:45 UTC +00:00]]

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(params[:page])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "pages" SET "name" = 'test', "content" = 'test 3 renamed to **test**', "updated_at" = '2013-02-10 09:59:11.406492' WHERE "pages"."id" = 6

  def root
    @rootName = params[:root]
    @pages = Page.roots.select{|root| root.name == @rootName}
---
SELECT "pages".* FROM "pages" WHERE (parent_id IS NULL)

  def newRoot
    @rootName = params[:root]
    @pages = Page.roots.select{|root| root.name == @rootName}
---
SELECT "pages".* FROM "pages" WHERE (parent_id IS NULL)

  def child
    @rootName = params[:root]
    @pages = Page.roots.select{|root| root.name == @rootName}
---
SELECT "pages".* FROM "pages" WHERE (parent_id IS NULL)

  def newChild
    @rootName = params[:root]
    @pages = Page.roots.select{|root| root.name == @rootName}
    unless @pages.length == 0
      @children = params[:children].split('/')
      @page = findTreeNamedNode(@children, @pages[0])
      if @page.nil? # if not yet exists
        @children = params[:children].split('/')
        @ansNames = @children.first(@children.length - 1)
        @ans = findTreeNamedNode(@ansNames, @pages[0])
        if @ans.nil? # if we haven't part of full path for creatng node
          render :action => 'index'
        else
          @page = @ans.children.create("name" => @children.last())
---
SELECT "pages".* FROM "pages" WHERE (parent_id IS NULL)
INSERT INTO "pages" ("content", "created_at", "name", "parent_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", nil], ["created_at", Sun, 10 Feb 2013 09:53:20 UTC +00:00], ["name", "pppc"], ["parent_id", 4], ["updated_at", Sun, 10 Feb 2013 09:53:20 UTC +00:00]]